## Import the SQL database into Pandas.

In [48]:
## Import dependencies

import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import numpy as np
from config import username, password, database
from sqlalchemy import create_engine

In [49]:
# Create Database Connection
engine = create_engine(f"postgresql://{username}:{password}@localhost:5432/{database}")
conn = engine.connect()

## Create a histogram to visualize the most common salary ranges for employees.

In [50]:
#Reading DataFrame from database
salary_df = pd.read_sql("SELECT * FROM Salaries", conn)
salary_df.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [51]:
title_df = pd.read_sql("SELECT * FROM titles", conn)
title_df.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer